# Создаем список из 3 гостей и выводим имя каждого.
guests = ['Cristiano Ronaldo', 'Dmitry Ilin', 'Zine Zidane']

print("Приглашаю тебя на обед, " + guests[0] + "!")
print("Приглашаю тебя на обед, " + guests[1] + "!")
print("Приглашаю тебя на обед, " + guests[2] + "!\n")


# Гость№2 не сможет прийти, приглашаем нового гостя.
print(guests[2] + " не сможет прийти на обед.\n")
 
guests[2] = 'Fede Valverde' # Присваеваем новоем имя.

print("Приглашаю тебя на обед, " + guests[0] + "!")
print("Приглашаю тебя на обед, " + guests[1] + "!")
print("Приглашаю тебя на обед, " + guests[2] + "!")


# Приглашаем дополнительно пару человек, меняя список.
print("\nМогу пригласить ещё гостей!\n")

guests.insert(0, 'Yaya Toure') # 'insert'-метод добавления в определенное место списка.
guests.insert(2, 'Toni Kroos')
guests.append('Max Khatimov') # 'append'-метод добавления в конец списка.

print("Приглашаю тебя на обед, " + guests[0] + "!")
print("Приглашаю тебя на обед, " + guests[1] + "!")
print("Приглашаю тебя на обед, " + guests[2] + "!")
print("Приглашаю тебя на обед, " + guests[3] + "!")
print("Приглашаю тебя на обед, " + guests[4] + "!")
print("Приглашаю тебя на обед, " + guests[5] + "!")


# Сокращение списка гостей
print("\nК сожалению, не смогу пригласить больше  гостей.")
print("Теперь я могу пригласить только двух гостей.\n")

# 'pop'-метод который удаляет элемент по индексу и возвращает его.
# Если не указать индекс, pop() удалит последний элемент
removed_guest = guests.pop() 
print(removed_guest + ", к сожалению, я вынужден отменить приглашение.")

removed_guest = guests.pop()
print(removed_guest + ", к сожалению, я вынужден отменить приглашение.")

removed_guest = guests.pop()
print(removed_guest + ", к сожалению, я вынужден отменить приглашение.")

removed_guest = guests.pop()
print(removed_guest + ", к сожалению, я вынужден отменить приглашение.")

print("\nПриглашения остаются в силе:")

print(guests[0] + ", ты всё ещё приглашён на обед!")
print(guests[1] + ", ты всё ещё приглашён на обед!")

# 'del'-удаляет элемент, не возвращает удалённый элемент, как метод pop
del guests[0]
del guests[0]

print("\nИтоговый список гостей:")
print(guests)
